## DATA-604

In [2]:
import pandas as pd
import sqlalchemy as sq

In [3]:
# Load the datasets into individual dataframe
avg_rent_df = pd.read_csv("datasets/average_rent_municipality.csv")
avg_rent_df = avg_rent_df.rename(
    columns={
        "CSD": "municipality",
        "Period": "year",
        "Rental Unit Type": "rental_type",
        "OriginalValue": "value",
    }
)
avg_rent_df = avg_rent_df.drop("CSDUID", axis=1)
avg_rent_df = avg_rent_df.drop("IndicatorSummaryDescription", axis=1)
avg_rent_df = avg_rent_df.drop("UnitOfMeasure", axis=1)
avg_rent_df["municipality"] = avg_rent_df["municipality"].str.lower()
avg_rent_df["rental_type"] = avg_rent_df["rental_type"].str.lower()

avg_rent_df.head()

# Load others

  municipality  year  rental_type  value
0     red deer  1987  1 - bedroom  377.0
1     red deer  1988  1 - bedroom  379.0
2     red deer  1989  1 - bedroom  388.0
3     red deer  1990  1 - bedroom  413.0
4     red deer  1991  1 - bedroom  429.0

In [4]:
# Load the datasets into individual dataframe
oil_production_df = pd.read_csv("datasets/oil_production_municipality.csv")
oil_production_df = oil_production_df.rename(
    columns={
        "CSD": "municipality",
        "Period": "year",
        "OriginalValue": "value",
    }
)
oil_production_df = oil_production_df.drop("CSDUID", axis=1)
oil_production_df = oil_production_df.drop("IndicatorSummaryDescription", axis=1)
oil_production_df = oil_production_df.drop("UnitOfMeasure", axis=1)
oil_production_df["municipality"] = oil_production_df["municipality"].str.lower()
oil_production_df.head()

  municipality  year   value
0   drumheller  2003  3138.0
1   drumheller  2004  3291.5
2   drumheller  2005  5311.0
3   drumheller  2006  5141.0
4   drumheller  2007  5477.0

In [5]:
# Load the datasets into individual dataframe
natural_gas_production_df = pd.read_csv("datasets/natural_gas_production_municipality.csv")
natural_gas_production_df = natural_gas_production_df.rename(
    columns={
        "CSD": "municipality",
        "Period": "year",
        "OriginalValue": "value",
    }
)
natural_gas_production_df = natural_gas_production_df.drop("CSDUID", axis=1)
natural_gas_production_df = natural_gas_production_df.drop("IndicatorSummaryDescription", axis=1)
natural_gas_production_df = natural_gas_production_df.drop("UnitOfMeasure", axis=1)
natural_gas_production_df["municipality"] = natural_gas_production_df["municipality"].str.lower()
natural_gas_production_df.head()

  municipality  year     value
0   drumheller  2003  104493.2
1   drumheller  2004  105486.4
2   drumheller  2005  130930.0
3   drumheller  2006  128564.0
4   drumheller  2007  124354.0

In [6]:
# Load the datasets into individual dataframe
natural_gas_price_df = pd.read_csv("datasets/natural_gas_price.csv", encoding='utf-16', sep='\t').T
natural_gas_price_df = natural_gas_price_df.reset_index()
natural_gas_price_df = natural_gas_price_df.rename(columns={'index': 'year'})
cleaned_natural_gas_data = []
for index, row in natural_gas_price_df.iterrows():
    if index == 0:
        continue
    year = int(row[0]) if not pd.isna(row[0]) else 0
    price = row[1] if not pd.isna(row[1]) else 0.0
    cleaned_natural_gas_data.append({'year': year, 'price': price})
natural_gas_price_df = pd.DataFrame(cleaned_natural_gas_data)
natural_gas_price_df.head()

   year  price
0  2002   3.95
1  2003   6.16
2  2004   6.31
3  2005   8.23
4  2006   6.43

In [7]:
# Load the datasets into individual dataframe
census_employment_df = pd.read_csv("datasets/census_employment_municipality.csv")
census_employment_df = census_employment_df.rename(
    columns={
        "CSD": "municipality",
        "Period": "year",
        "OriginalValue": "rate",
        "Gender": "gender",
        "IndicatorSummaryDescription": "category"
    }
)
census_employment_df = census_employment_df.drop("CSDUID", axis=1)
census_employment_df = census_employment_df.drop("UnitOfMeasure", axis=1)
census_employment_df["category"] = census_employment_df["category"].str.lower()
census_employment_df["gender"] = census_employment_df["gender"].str.lower()
census_employment_df["municipality"] = census_employment_df["municipality"].str.lower()
census_employment_df.head()

  municipality  year            category  gender   rate
0    sedgewick  1981  participation rate  female  0.389
1    sedgewick  1986  participation rate  female  0.397
2    sedgewick  1991  participation rate  female  0.576
3    sedgewick  1996  participation rate  female  0.431
4    sedgewick  2001  participation rate  female  0.587

In [8]:
# Load the datasets into individual dataframe
well_count_df = pd.read_csv("datasets/well_count_municipality.csv")
well_count_df = well_count_df.rename(
    columns={
        "CSD": "municipality",
        "Period": "year",
        "OriginalValue": "value",
    }
)
well_count_df = well_count_df.drop("CSDUID", axis=1)
well_count_df = well_count_df.drop("IndicatorSummaryDescription", axis=1)
well_count_df = well_count_df.drop("UnitOfMeasure", axis=1)
well_count_df["municipality"] = well_count_df["municipality"].str.lower()

well_count_df.head()

  municipality  year  value
0   drumheller  2003   10.0
1   drumheller  2004   35.0
2   drumheller  2005   21.0
3   drumheller  2006   17.0
4   drumheller  2007   11.0

In [9]:
# create a set of municipalites
dfs_with_municipalities = [avg_rent_df, oil_production_df, natural_gas_production_df, census_employment_df, well_count_df]

municipalities_df = (
    pd.concat([df['municipality'] for df in dfs_with_municipalities])
    .drop_duplicates()
    .reset_index(drop=True)
    .to_frame(name='municipality')
)

municipalities_df = municipalities_df.sort_values(by='municipality').reset_index(drop=True)
municipalities_df['id'] = range(1, len(municipalities_df) + 1)
municipalities_df.head()

    municipality  id
0  acadia no. 34   1
1           acme   2
2        airdrie   3
3  alberta beach   4
4  alexander 134   5

In [10]:
# Load the datasets into individual dataframe
oil_price_df = pd.read_csv("datasets/oil_price.csv")
oil_price_df = oil_price_df.rename(
    columns={
        "Date": "date",
        "Value": "value",
    }
)
oil_price_df = oil_price_df.drop("Series", axis=1)
oil_price_df = oil_price_df.drop("labels", axis=1)
oil_price_df.head()

         date  value
0  2005-01-01  29.42
1  2005-02-01  28.44
2  2005-03-01  36.50
3  2005-04-01  31.02
4  2005-05-01  27.46

In [11]:
if 'municipality' in avg_rent_df.columns:
    avg_rent_df = avg_rent_df.merge(
        municipalities_df,
        on='municipality',
        how='left'
    )
    avg_rent_df = avg_rent_df.rename(columns={'id': 'municipality_id'})
    avg_rent_df = avg_rent_df.drop("municipality", axis=1)

if 'municipality' in oil_production_df.columns:
    oil_production_df = oil_production_df.merge(
        municipalities_df,
        on='municipality',
        how='left'
    )
    oil_production_df = oil_production_df.rename(columns={'id': 'municipality_id'})
    oil_production_df = oil_production_df.drop("municipality", axis=1)

if 'municipality' in natural_gas_production_df.columns:
    natural_gas_production_df = natural_gas_production_df.merge(
        municipalities_df,
        on='municipality',
        how='left'
    )
    natural_gas_production_df = natural_gas_production_df.rename(columns={'id': 'municipality_id'})
    natural_gas_production_df = natural_gas_production_df.drop("municipality", axis=1)

if 'municipality' in census_employment_df.columns:
    census_employment_df = census_employment_df.merge(
        municipalities_df,
        on='municipality',
        how='left'
    )
    census_employment_df = census_employment_df.rename(columns={'id': 'municipality_id'})
    census_employment_df = census_employment_df.drop("municipality", axis=1)
    
if 'municipality' in well_count_df.columns:
    well_count_df = well_count_df.merge(
        municipalities_df,
        on='municipality',
        how='left'
    )
    well_count_df = well_count_df.rename(columns={'id': 'municipality_id'})
    well_count_df = well_count_df.drop("municipality", axis=1)

municipalities_df = municipalities_df.rename(
    columns={
        "municipality": "name"
    }
)

In [12]:
# define sql connection here
usersname = 'root'
password = 'root'
database_name = 'project_604'
port = 3306

In [13]:
engine = sq.create_engine(
    f"mysql+mysqlconnector://{usersname}:{password}@localhost:{port}/{database_name}"
)

In [14]:
# Drop and recreate the tables
drop_table_query = """
DROP TABLE IF EXISTS `municipalities_rent`;
"""

create_municipalities_rent_table_query = """
CREATE TABLE IF NOT EXISTS `municipalities_rent` (
    `id` BIGINT NOT NULL AUTO_INCREMENT,
    `municipality_id` BIGINT NOT NULL,
    `year` YEAR NOT NULL,
    `rental_type` ENUM('2 - bedroom', '3 - bedroom', 'bachelor', '1 - bedroom') NOT NULL,
    `value` FLOAT NOT NULL,
    PRIMARY KEY (`id`)
);
"""

with engine.connect() as connection:
    connection.execute(sq.text(drop_table_query))
    connection.execute(sq.text(create_municipalities_rent_table_query))
    connection.commit()

In [15]:
# Drop and recreate the tables
drop_table_query = """
DROP TABLE IF EXISTS `municipalities_oil_production`;
"""

create_municipalities_oil_production_query = """
CREATE TABLE IF NOT EXISTS `municipalities_oil_production` (
    `id` BIGINT NOT NULL AUTO_INCREMENT,
    `municipality_id` BIGINT NOT NULL,
    `year` YEAR NOT NULL,
    `value` FLOAT NOT NULL,
    PRIMARY KEY (`id`)
);
"""



with engine.connect() as connection:
    connection.execute(sq.text(drop_table_query))
    connection.execute(sq.text(create_municipalities_oil_production_query))
    connection.commit()

In [16]:
# Drop and recreate the tables
drop_table_query = """
DROP TABLE IF EXISTS `municipalities_natural_gas_production`;
"""

create_municipalities_natural_gas_production_query = """
CREATE TABLE IF NOT EXISTS `municipalities_natural_gas_production`(
    `id` BIGINT NOT NULL AUTO_INCREMENT,
    `municipality_id` BIGINT NOT NULL,
    `year` YEAR NOT NULL,
    `value` FLOAT NOT NULL,
    PRIMARY KEY (`id`)
);
"""



with engine.connect() as connection:
    connection.execute(sq.text(drop_table_query))
    connection.execute(sq.text(create_municipalities_natural_gas_production_query))
    connection.commit()

In [17]:
# Drop and recreate the tables
drop_table_query = """
DROP TABLE IF EXISTS `municipalities_well_count`;
"""

create_municipalities_well_count_query = """
CREATE TABLE IF NOT EXISTS `municipalities_well_count` (
    `id` BIGINT NOT NULL AUTO_INCREMENT,
    `municipality_id` BIGINT NOT NULL,
    `year` YEAR NOT NULL,
    `value` INT NOT NULL,
    PRIMARY KEY (`id`)
);
"""

with engine.connect() as connection:
    connection.execute(sq.text(drop_table_query))
    connection.execute(sq.text(create_municipalities_well_count_query))
    connection.commit()

In [18]:
# Drop and recreate the tables
drop_table_query = """
DROP TABLE IF EXISTS `natural_gas_price`;
"""

create_natural_gas_price_query = """
CREATE TABLE IF NOT EXISTS `natural_gas_price` (
    `id` BIGINT NOT NULL AUTO_INCREMENT,
    `year` YEAR NOT NULL,
    `price` FLOAT NOT NULL,
    PRIMARY KEY (`id`)
);
"""

with engine.connect() as connection:
    connection.execute(sq.text(drop_table_query))
    connection.execute(sq.text(create_natural_gas_price_query))
    connection.commit()

In [19]:
# Drop and recreate the tables
drop_table_query = """
DROP TABLE IF EXISTS `census_employment_rate`;
"""

create_census_employment_rate_query = """
CREATE TABLE IF NOT EXISTS `census_employment_rate`(
    `id` BIGINT NOT NULL AUTO_INCREMENT,
    `municipality_id` BIGINT NOT NULL,
    `year` YEAR NOT NULL,
    `gender` ENUM('male', 'both', 'female', '') NOT NULL,
    `category` ENUM('unemployment rate', 'employment rate', 'participation rate', '') NOT NULL,
    `rate` FLOAT NOT NULL,
    PRIMARY KEY (`id`)
);
"""



with engine.connect() as connection:
    connection.execute(sq.text(drop_table_query))
    connection.execute(sq.text(create_census_employment_rate_query))
    connection.commit()

In [20]:
# Drop and recreate the tables
drop_table_query = """
DROP TABLE IF EXISTS `oil_price`;
"""

create_oil_price_query = """
CREATE TABLE IF NOT EXISTS `oil_price` (
    `id` BIGINT NOT NULL AUTO_INCREMENT,
    `date` DATE NOT NULL,
    `value` FLOAT NOT NULL,
    PRIMARY KEY (`id`)
);
"""

with engine.connect() as connection:
    connection.execute(sq.text(drop_table_query))
    connection.execute(sq.text(create_oil_price_query))
    connection.commit()

In [21]:
# Drop and recreate the tables
drop_table_query = """
DROP TABLE IF EXISTS `municipalities`;
"""

create_municipalities_query = """
CREATE TABLE IF NOT EXISTS `municipalities` (
    `id` BIGINT NOT NULL AUTO_INCREMENT,
    `name` VARCHAR(200) NOT NULL,
    PRIMARY KEY (`id`)
);
"""

with engine.connect() as connection:
    connection.execute(sq.text(drop_table_query))
    connection.execute(sq.text(create_municipalities_query))
    connection.commit()

In [22]:
# Load the dataframe into the database
avg_rent_df.to_sql('municipalities_rent', engine, if_exists='append', index=False, chunksize = 1000)
oil_production_df.to_sql('municipalities_oil_production', engine, if_exists='append', index=False, chunksize = 1000)
natural_gas_production_df.to_sql('municipalities_natural_gas_production', engine, if_exists='append', index=False, chunksize = 1000)
well_count_df.to_sql('municipalities_well_count', engine, if_exists='append', index=False, chunksize = 1000)
census_employment_df.to_sql('census_employment_rate', engine, if_exists='append', index=False, chunksize = 1000)
natural_gas_price_df.to_sql('natural_gas_price', engine, if_exists='append', index=False, chunksize = 1000)
oil_price_df.to_sql('oil_price', engine, if_exists='append', index=False, chunksize = 1000)
municipalities_df.to_sql('municipalities', engine, if_exists='append', index=False,chunksize=1000)

414

In [23]:
#Query to get the top 5 municipalities with the lowest female employment rate for each year

query4 = '''SELECT municipalities.name AS municipality, gender, category, year
            FROM census_employment_rate
            JOIN municipalities ON (census_employment_rate.municipality_id = municipalities.id)
            WHERE gender = 'female' AND category = 'employment rate'
            ORDER BY year, rate ASC
            LIMIT 5;
            '''
lowest_employment_rate_female = pd.read_sql_query(query4,engine)
lowest_employment_rate_female.head()

    municipality  gender         category  year
0   silver sands  female  employment rate  1981
1       rosalind  female  employment rate  1981
2      west cove  female  employment rate  1981
3  duncan's 151a  female  employment rate  1981
4  tall cree 173  female  employment rate  1981

In [24]:
#Query to get the total volume of oil for each municipality during the COVID Pandemic (2020 - 2022)

query = '''SELECT municipalities.name, SUM(value) AS total_volume
            FROM municipalities_oil_production
            JOIN municipalities ON (municipalities_oil_production.municipality_id = municipalities.id)
            WHERE year IN ('2020', '2021','2022')
            GROUP BY municipalities.name; 
            '''
total_oil_volume = pd.read_sql_query(query,engine)
total_oil_volume.head()

                     name  total_volume
0           acadia no. 34  3.040900e+03
1        athabasca county  3.940219e+05
2  barrhead county no. 11  2.330690e+04
3           beaver county  2.736886e+05
4        big lakes county  3.603638e+06

In [25]:
#Query to get the total volume of oil for each municipality for the years 2014 - 16

query1 = '''SELECT municipalities.name, SUM(value) AS total_volume
            FROM municipalities_oil_production
            JOIN municipalities ON (municipalities_oil_production.municipality_id = municipalities.id)
            WHERE year IN ('2014', '2015', '2016')
            GROUP BY municipalities.name;
            '''
total_oil_crisis_volume = pd.read_sql_query(query1,engine)
total_oil_crisis_volume.head()

                     name  total_volume
0           acadia no. 34  2.185300e+03
1        athabasca county  5.457400e+03
2  barrhead county no. 11  4.518690e+04
3           beaver county  4.204949e+05
4        big lakes county  4.754275e+06

In [26]:
#Query to get the total volume of natural gas for each municipality during the COVID Pandemic (2020 - 2022)

query2 = '''SELECT municipalities.name, SUM(value) AS total_gas
            FROM municipalities_natural_gas_production
            JOIN municipalities ON (municipalities_natural_gas_production.municipality_id = municipalities.id)
            WHERE year IN ('2020', '2021', '2022')
            GROUP BY municipalities.name;
            '''
total_oil_pandemic_volume = pd.read_sql_query(query2,engine)
total_oil_pandemic_volume.head()

                     name      total_gas
0           acadia no. 34   11827.399902
1        athabasca county  212987.703125
2  barrhead county no. 11  269168.199219
3           beaver county  555724.515625
4        big lakes county  564278.000000

In [27]:
#Query to get the top 5 municipalities by well count

query3 = '''SELECT municipalities.name, SUM(value) AS total_wells 
            FROM municipalities_well_count
            JOIN municipalities ON (municipalities_well_count.municipality_id = municipalities.id)
            GROUP BY municipalities.name
            ORDER BY total_wells desc
            LIMIT 5
            '''
well_count = pd.read_sql_query(query3,engine)
well_count.head()

                name  total_wells
0       wood buffalo      30093.0
1     cypress county      12958.0
2   greenview no. 16      12497.0
3  bonnyville no. 87      12323.0
4      newell county      10397.0

In [28]:
#Query to get the top 5 oil-producing municipalities:

query_1 ='''SELECT municipalities.name AS municipality, SUM(value) AS oilproduction_total 
            FROM municipalities_oil_production 
            JOIN municipalities ON (municipalities_oil_production.municipality_id = municipalities.id) 
            GROUP BY municipalities_oil_production.municipality_id 
            ORDER BY oilproduction_total DESC LIMIT 5'''
                            
query_1 = pd.read_sql_query(query_1,engine)
query_1.head()

                   municipality  oilproduction_total
0                  wood buffalo         1.486925e+09
1             bonnyville no. 87         2.616762e+08
2  improvement district no. 349         2.152702e+08
3           lac la biche county         9.729472e+07
4            opportunity no. 17         8.814485e+07

In [34]:
#Query to get the total well count for each municipality during the COVID Pandemic (2020 - 2022) 

query_2 ='''SELECT municipalities.name AS municipality, SUM(value) AS wellcount_total 
            FROM municipalities_well_count JOIN municipalities ON (municipalities_well_count.municipality_id =municipalities.id) 
            WHERE year BETWEEN 2020 AND 2022 
            GROUP BY municipalities_well_count.municipality_id 
            ORDER BY wellcount_total DESC'''


query_2 = pd.read_sql_query(query_2,engine)
query_2.head()

                municipality  wellcount_total
0  lesser slave river no.124           4273.0
1               wood buffalo           1626.0
2          bonnyville no. 87           1351.0
3           greenview no. 16           1206.0
4           athabasca county            776.0

In [36]:
#Query to get the years that had the highest and lowest oil production in Calgary

query_3_highest ='''SELECT year, value FROM municipalities_oil_production 
                    JOIN municipalities ON (municipalities_oil_production.municipality_id = municipalities.id) 
                    WHERE municipalities.name = 'Calgary' 
                    ORDER BY value DESC LIMIT 1'''

query_3_highest = pd.read_sql_query(query_3_highest,engine)
print(query_3_highest)


query_3_lowest ='''SELECT year, value FROM municipalities_oil_production 
                    JOIN municipalities ON (municipalities_oil_production.municipality_id = municipalities.id) 
                    WHERE municipalities.name = 'Calgary' 
                    ORDER BY value ASC LIMIT 1'''

query_3_lowest = pd.read_sql_query(query_3_lowest,engine)
print(query_3_lowest)

   year   value
0  2005  7776.0
   year  value
0  2023  288.3

In [37]:
#Query to get the years that had the highest and lowest natural gas production in Calgary 

query_4_highest ='''SELECT year, value FROM municipalities_natural_gas_production 
                    JOIN municipalities ON (municipalities_natural_gas_production.municipality_id = municipalities.id) 
                    WHERE municipalities.name = 'Calgary' 
                    ORDER BY value DESC LIMIT 1'''


query_4_highest = pd.read_sql_query(query_4_highest,engine)
print(query_4_highest)


query_4_lowest ='''SELECT year, value FROM municipalities_natural_gas_production 
                    JOIN municipalities ON (municipalities_natural_gas_production.municipality_id = municipalities.id) 
                    WHERE municipalities.name = 'Calgary' 
                    ORDER BY value ASC LIMIT 1'''


query_4_lowest = pd.read_sql_query(query_4_lowest,engine)
print(query_4_lowest)

   year     value
0  2005  127274.0
   year  value
0  2018  461.3

In [32]:
#Query to get the municipality with the highest female employment rate per census year

query_5 = pd.read_sql_query("SELECT year, municipalities.name AS municipality, rate FROM census_employment_rate JOIN municipalities ON census_employment_rate.municipality_id = municipalities.id WHERE gender = 'female' AND category = 'employment rate' ORDER BY year, rate DESC;", engine)
print (query_5)

      year                             municipality     rate
0     1981        improvement district no.  9 banff  0.75743
1     1981                                gull lake  0.75000
2     1981  improvement district no. 12 jasper park  0.70149
3     1981                               high level  0.66887
4     1981                                   munson  0.66667
...    ...                                      ...      ...
3170  2021                                waiparous  0.00000
3171  2021  improvement district no. 12 jasper park  0.00000
3172  2021                     stoney 142, 143, 144  0.00000
3173  2021                             wabasca 166b  0.00000
3174  2021                             sunset beach  0.00000

[3175 rows x 3 columns]

In [39]:
# This query returns the municipality with the lowest male employment rate per census year

query_1 = pd.read_sql_query("""
                                WITH t1 AS
                                    (SELECT year, name, rate, ROW_NUMBER() OVER (PARTITION BY year ORDER BY rate) AS rnk
                                    FROM census_employment_rate c
                                    JOIN municipalities m
                                    ON c.municipality_id = m.id
                                    WHERE gender = 'male'
                                    AND category = 'employment rate'
                                    )
                                    
                                SELECT year, name, rate
                                FROM t1
                                WHERE rnk = 1
                                ORDER BY year""",
                            engine)

query_1.head()

ProgrammingError: (mysql.connector.errors.ProgrammingError) 1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 't1 AS
                                    (SELECT year, name, rate, ROW_NUMBER()' at line 1
[SQL:
                                WITH t1 AS
                                    (SELECT year, name, rate, ROW_NUMBER() OVER (PARTITION BY year ORDER BY rate) AS rnk
                                    FROM census_employment_rate c
                                    JOIN municipalities m
                                    ON c.municipality_id = m.id
                                    WHERE gender = 'male'
                                    AND category = 'employment rate'
                                    )

                                SELECT year, name, rate
                                FROM t1
                                WHERE rnk = 1
                                ORDER BY year]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [ ]:
# This query returns the employment rates across the census years for males, females and both

query_2 = pd.read_sql_query("""
                                SELECT year, gender, AVG(rate) AS average_rate
                                FROM census_employment_rate
                                GROUP BY year, gender
                                ORDER BY year""",
                            engine)

query_2.head()

   year  gender  average_rate
0  1981    male      0.503616
1  1981    both      0.408234
2  1981  female      0.314030
3  1986    male      0.511279
4  1986    both      0.436002

In [ ]:
# This query returns the volume of natural gas for each municipality for the oil crash years of 2014 - 2016

query_3 = pd.read_sql_query("""
                                SELECT name, AVG(value) AS average_volume
                                FROM municipalities_natural_gas_production m1
                                JOIN municipalities m2
                                ON m1.id = m2.id
                                WHERE year BETWEEN 2014 and 2016
                                GROUP BY name""",
                            engine)

query_3.head()

               name  average_volume
0    argentia beach    58207.000000
1         arrowwood    52249.000000
2         athabasca    52705.699219
3  big lakes county   759487.312500
4        big valley   714994.625000

In [ ]:
# This query returns the average oil price per year

query_4 = pd.read_sql_query("""
                                SELECT YEAR(date), AVG(value) AS average_price
                                FROM oil_price
                                GROUP BY YEAR(date)
                                ORDER BY YEAR(date)""",
                            engine)

query_4.head()

   YEAR(date)  average_price
0        1986      15.036667
1        1987      19.171667
2        1988      15.982500
3        1989      19.640834
4        1990      24.467500

In [ ]:
# This query returns the distinct municipalities in the oil production dataset

query_5 = pd.read_sql_query("""
                                SELECT name
                                FROM municipalities""",
                            engine)

query_5.head()

            name
0  acadia no. 34
1           acme
2        airdrie
3  alberta beach
4  alexander 134

In [ ]:
# Query to get all the distinct rental types

query = '''
   SELECT DISTINCT rental_type FROM municipalities_rent;
'''

all_rental_types = pd.read_sql_query(query, engine)

print(f"\nRetrieved {len(all_rental_types)} distinct rental types:")
print(all_rental_types['rental_type'].to_string(index=False))

In [ ]:
# Query to get the top 5 municipalities with the highest rent for each rental type

for rental_type in all_rental_types['rental_type']:
    query = f"""
    SELECT DISTINCT municipality, rental_type, average_rent
    FROM (
        SELECT m.name AS municipality, mr.rental_type, AVG(mr.value) AS average_rent
        FROM municipalities_rent mr
        JOIN municipalities m ON mr.municipality_id = m.id
        WHERE mr.rental_type = '{rental_type_safe}'
        GROUP BY m.name, mr.rental_type
    ) AS avg_rents
    ORDER BY average_rent DESC
    LIMIT 5;
    """
    
    df = pd.read_sql_query(query, engine)
    top_rents_by_type.append(df)
    
    print(f"\nTop 5 municipalities for rental type: **{rental_type}**")
    print(df[['municipality', 'average_rent']].to_string(index=False))

In [ ]:
# Query to get the top 5 natural gas-producing municipalities

query = '''
SELECT
    m.name AS municipality,
    SUM(mngp.value) AS total_production
FROM municipalities_natural_gas_production mngp
JOIN municipalities m ON mngp.municipality_id = m.id
GROUP BY m.name
ORDER BY total_production DESC
LIMIT 5;
'''

top_gas_municipalities = pd.read_sql_query(query, engine)


print("\nTop 5 Municipalities by Natural Gas Production:")
print(top_gas_municipalities.to_string(index=False, header=["Municipality", "Total Production"]))

In [ ]:
# Query to get the well count for each municipality for the years 2014 - 16

query = '''
SELECT
    m.name AS municipality,
    mwc.year,
    mwc.value AS well_count
FROM municipalities_well_count mwc
JOIN municipalities m ON mwc.municipality_id = m.id
WHERE mwc.year BETWEEN 2014 AND 2016
ORDER BY mwc.year, m.name;
'''

well_counts = pd.read_sql_query(query, engine)

print("\nWell Count by Municipality (20142016):")
print(well_counts.to_string(index=False, header=["Municipality", "Year", "Well Count"]))